Repository: Claymanus/wp_oauth_plugin
Catalog: eDemo-SSOauth/languages/eDemo-SSO-*.po
Languages: hu_hu

source: SSO login
hu_hu: SSO bejelentkezés

source: SSO user data
hu_hu: adatok az SSO szolgáltatásból

source: eDemo SSO Authentication Options
hu_hu: eDemo SSO plugin beállítása

source: Application name:
hu_hu: Alkalmazás neve:

source: Used for registering the application
hu_hu: Ezzel a névvel regisztráljuk az alkalmazást az eDemo SSO szolgáltatásban.

source: Application key:
hu_hu: Alklamazás kulcs

source: Application key.
hu_hu: Az alkalmazás azonosításához kell az SSO szerverrel való kommunikáció során.

source: Application secret:
hu_hu: Az alkalmazás titkos kódja:

source: Application secret.
hu_hu: Az alkalmazás azonosításához kell az SSO szerverrel való kommunikáció során.

source: Allow verify ssl certificates:
hu_hu: SSL tanusítvány ellenőrzése:

source: If this set, the ssl certificates will be verified during the communication with sso server. Uncheck is recommended if your site has no cert, or the issuer isn't validated.
hu_hu: Ha ez be van állítva, az SSL tanusítványok ellenőrizve lesznek az SSO szerverrel való kommunikáció során. Ajánlott kikapcsolni, ha ennek a site-nak nincs SSL tanusítványa, vagy a kiállítója nincs validálva.

source: SSO account binding:
hu_hu: Felhasználói fiók összekötése:

source: If this set, a SSO account can be binded with the given Wordpress account. User gets a 'bind' button on his datasheet and in the SSO login widget.
hu_hu: Ha ez be van kapcsolava, egy meglévő Worpress fiókhoz hozzárendelhetünk egy SSO fiókot. Az SSO azonosítóval még nem rendelkező bejelentkezett Worpress felhasználónak 'fiók összekötése' gombok jelennek meg a login widget-ben illetve a profil oldalán.

source: Default WP role for SSO usrs:
hu_hu: Alapértelmezett WP szerepkör:

source: The default WP role, which will be added during the SSO registration
hu_hu: Ez a szerepkör lesz hozzáadva az SSO-val regisztráló felhasználók profiljához.

source: Update Options
hu_hu: Módosítások mentése

source: You are signed in
hu_hu: Ön sikeresen bejelentkezett.

source: Can't log in
hu_hu: A bejelentkezés nem sikerült.

source: User's SSO data has been updated successfully
hu_hu: A felhasználó SSO adatait frissítettük.

source: User not found
hu_hu: A felhasználó nem létezik.

source: Old SSO user has been erased, its data has been reassigned to the current user.
hu_hu: Az korábbi SSO felhasználót töröltük, az adatait a jelenlegi felhasználóhoz rendeltük

source: SSO account has been binded successfully
hu_hu: A felhasználói fiók hozzárendelése megtörtént.

source: Invalid page request - missing code
hu_hu: Nem megfelelő lekérés - az azonosító kód hiányzik.

source: The SSO-server's response:
hu_hu: Az SSO szerver üzenete:

source: Unexpected response cames from SSO Server
hu_hu: Váratlan üzenet érkezett az SSO szervertől.

source: Invalid response has been came from SSO server
hu_hu: Nem értelmezhető üzenet érkezett az SSO szervertől.

source: Show user profile
hu_hu: Felhasználói profil

source: Logout
hu_hu: Kijelentkezés

source: Login with SSO
hu_hu: Bejelentkezés

source: Register with SSO
hu_hu: Regisztráció

source: eDemo SSO authentication
hu_hu: eDemo SSO felhasználó azonosítás

source: Allows you connect to the Edemo SSO server, and autenticate the users, who acting on your site
hu_hu: Lehetővé teszi a felhasználók azonosítását az eDemo SSO szolgáltatáson keresztül.
