Repository: Claymanus/wp_oauth_plugin
Catalog: eDemo-SSOauth/languages/eDemo-SSOauth-*.po
Languages: hu_hu

source: Options updated.
hu_hu: Beállítások frissítve

source: eDemo SSO Authentication Options
hu_hu: eDemo SSO plugin beállítása

source: SSO service URL:
hu_hu: ADA szolgáltatás URL:

source: The base URL of the SSO service
hu_hu: ADA szolgáltatás domain URL-je

source: Application name:
hu_hu: Alkalmazás neve:

source: Used for registering the application
hu_hu: Ezzel a névvel regisztráljuk az alkalmazást az eDemo ADA szolgáltatásban.

source: Application key:
hu_hu: Alklamazás kulcs

source: Application key.
hu_hu: Az alkalmazás azonosításához kell az ADA szerverrel való kommunikáció során.

source: Application secret:
hu_hu: Az alkalmazás titkos kódja:

source: Application secret.
hu_hu: Az alkalmazás azonosításához kell az ADA szerverrel való kommunikáció során.

source: Allow verify ssl certificates:
hu_hu: SSL tanusítvány ellenőrzése:

source: If this set, the ssl certificates will be verified during the communication with sso server. Uncheck is recommended if your site has no cert, or the issuer isn't validated.
hu_hu: Ha ez be van állítva, az SSL tanusítványok ellenőrizve lesznek az ADA szerverrel való kommunikáció során. Ajánlott kikapcsolni, ha ennek a site-nak nincs SSL tanusítványa, vagy a kiállítója nincs validálva.

source: SSO account binding:
hu_hu: Felhasználói fiók összekötése:

source: If this set, a SSO account can be binded with the given Wordpress account. User gets a 'bind' button on his datasheet and in the SSO login widget.
hu_hu: Ha ez be van kapcsolava, egy meglévő Worpress fiókhoz hozzárendelhetünk egy SSO fiókot. Az SSO azonosítóval még nem rendelkező bejelentkezett Worpress felhasználónak 'fiók összekötése' gombok jelennek meg a login widget-ben illetve a profil oldalán.

source: Allow registering:
hu_hu: A regisztráció engedélyezett:

source: This setting allows the user registrating with SSO service.
hu_hu: Ez a beállítás engedélyezi, hogy a felhasználó regisztráljon az ADA szolgáltatás segítságável.

source: Allow sign in:
hu_hu: A bejelentkezés engedélyezett:

source: This setting allows the users logging in. In emergency case unset this option to forbid the users logging in
hu_hu: Ez a beállítás engedélyezi a bejelentkezést az ADA szolgáltatás segítségével. Kikapcsolásával - például az oldal karbantartása alatt - megakadályozhatjuk , hogy a felhasználók bejelentkezzenek.

source: Hide adminbar:
hu_hu: Adminbar kikapcsolása:

source: If this set, the hide admin bar option will be set on the users profile during registration process. That means, the admin bar willn't be shown as default if the user logged in. Anyway hide and show admin bar can be set on the user's profile page
hu_hu: Ha ezt bekapcsoljuk, nem fog látszódni az adminbar a felhasználóknak a megjelenített tartalom felett.

source: Default WP role for SSO usrs:
hu_hu: Alapértelmezett WP szerepkör:

source: The default WP role, which will be added during the SSO registration
hu_hu: Ez a szerepkör lesz hozzáadva az ADA-val regisztráló felhasználók profiljához.

source: Needed assurances:
hu_hu: Szükséges igazolások:

source: Comma separated list of assurances needed for allowing registering the user. Keep empty, if no assurance needed for registration.
hu_hu: A regisztrációhoz illetve belépéshez szükséges ADA igazolások vesszővel elválasztott listája. Ha ez üres, akkor nincs igazolás ellenőrzés.

source: Update Options
hu_hu: Módosítások mentése

source: SSO user data
hu_hu: adatok az ADA szolgáltatásból

source: Refresh
hu_hu: Frissítés

source: Downloads the assurences from the SSO service
hu_hu: Az igazolások letöltése az ADA szerverről

source: Unbind
hu_hu: Leválasztás

source: Unbinding SSO account from the user
hu_hu: Laválasztja az ADA fiókot erről a Wordpress fiókról

source: Bind SSO account
hu_hu: ADA fiók összekötése

source: This will bind your account with an SSO account. If you are logged in to your SSO account, this goes automaticly. Otherwise you will be redirected to the SSO login page served by SSO Service.
hu_hu: Ezzel összeköthető a felhasználói Wordpress fiókja az ADA fiókjával. Ha a felhasználó be van jelentkezve az ADA fiókjába, ez automatikusan megtörténik, ellenkező esetben az ADA bejelentkező felülete jelenik meg.

source: If you have here registered with your SSO account, that will be merged in this account with all activity data stored before. User data still remain.
hu_hu: Ha a felhasználó már regisztrált itt az ADA fiókjával, akkor a két fiók összeolvad, a jelenlegi felhasználóadatok megmaradnak, az ADA-s fiók felhasználói aktivitásából keletkezett adatok ehhez a fiókhoz rendelődnek.

source: Ban user
hu_hu: Felhasználó kizárása

source: Disable account:
hu_hu: Felhasználói fiók felfüggesztése:

source: Set this to ban the user. User will be unable to login.
hu_hu: Bekapcsolásával kizárható a felhasználó, nem tud bejelentkezni többet.

source: Your SSO metadata has been refreshed successfully
hu_hu: Frissítettük az Ön igazolásait az ADA szolgáltatásból

source: The user's SSO metadata has been refreshed successfully
hu_hu: Sikerült frissíteni a felhasználó igazolásait

source: Something went wrong, the userid is different as expected.
hu_hu: Hiba történt, a felhasználó azonosítója különbözik az elvárttól

source: Something went wrong, the user doesn't have SSO metada. Refresh aborted
hu_hu: Hiba történt. A felhasználó nem rendelkezik a SSO metaadatokkal. A frissítést megszakítottuk.

source: Registering with SSO service isn't allowed momentarily.<br/>Try to contact with the site administrator.
hu_hu: Az ADA szolgáltatással történő regisztráció nem engedélyezett pillanatnyilag.<br/>Lépjen kapcsolatba a weblap adminisztrátorával.

source: You are signed in
hu_hu: Ön sikeresen bejelentkezett.

source: Can't log in
hu_hu: A bejelentkezés nem sikerült.

source: This user hasn't registered yet. Would you like to <a href="%s">register</a>?
hu_hu: Ez a felhasználó még nem rendelkezik fiókkal. Szeretne <a href="%s">regisztrálni</a>?

source: You haven't account here, registering with SSO service isn't allowed momentarily.<br/>Try to contact with the site administrator.
hu_hu: Önnek még nincs felhasználói fiókja, a regisztráció pillanatnyilag nem engedélyezett.<br/>Lépjen kapcsolatba a weblap adminisztrátorával.

source: Old SSO user has been erased, its data has been reassigned to the current user.
hu_hu: Az korábbi ADA felhasználót töröltük, az adatait a jelenlegi felhasználóhoz rendeltük

source: SSO account has been binded successfully
hu_hu: A felhasználói fiók hozzárendelése megtörtént.

source: Your SSO metadata has been deleted. You can't login with SSO service anymore.
hu_hu: Az Ön ADA szolgáltatásból származó adatait töröltük, ADA fiókjával nem tud többet bejelentkezni.

source: SSO metadata has been deleted. The user can't login with SSO service anymore.
hu_hu: Az ADA szolgáltatásból származó adatokat töröltük, a felhasználó nem tud többé az ADA fiókjával bejelentkezni

source: Someting went wrong, can't delete usermeta
hu_hu: Hiba történt, nem tudjuk törölni a felhasználó metaadatait.

source: Something went wrong at refreshing user meta.
hu_hu: Hiba történt a felhasználó metaadatainak frissítése közben

source: <strong>ERROR</strong>: This user account is disabled.
hu_hu: <strong>HIBA</strong>: Ez a felhasználói fiók fel van függesztve.

source: Login / Logout
hu_hu: Bejelentkezés / Kilépés

source: The SSO-server's response:
hu_hu: Az ADA szerver üzenete:

source: Unexpected response cames from SSO Server
hu_hu: Váratlan üzenet érkezett az ADA szervertől.

source: Welcome
hu_hu: Üdvözöljük

source: Refresh SSO data
hu_hu: ADA adatok frissítése

source: Show user profile
hu_hu: Felhasználói profil

source: Logout
hu_hu: Kijelentkezés

source: Login with SSO
hu_hu: ADA bejelentkezés

source: Register with SSO
hu_hu: Regisztráció ADA fiókkal

source: Sorry! Login with SSO service isn't allowed temporarily.
hu_hu: Sajnáljuk! ADA fiókkal átmenetileg nem lehet bejelentkezni.

source: SSO services
hu_hu: ADA szolgáltaás

source: New title
hu_hu: Új cím

source: Title:
hu_hu: Cím:

source: SSO login
hu_hu: ADA bejelentkezés

source: SSO register
hu_hu: ADA regisztráció

source: SSO user
hu_hu: ADA felhasználó

source: The following assurances needed for registration:
hu_hu: Az alábbi ADA igazolások szükségesek a regisztrációhoz:

source: eDemo SSO authentication
hu_hu: ADA felhasználó azonosítás

source: Allows you connect to the Edemo SSO server, and autenticate the users, who acting on your site
hu_hu: Lehetővé teszi a felhasználók azonosítását az eDemo SSO szolgáltatáson keresztül.
